modules/cxf/src/test/resources/in-message-with-mustunderstand.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" soapenv:mustUnderstand="1">
            <wsse:UsernameToken xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="UsernameToken-27785692">
                <wsse:Username>joe</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">secret</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
        <name>Joe Schmoe</name>
    </soapenv:Header>
    <soapenv:Body>
        <ns2:greet xmlns:ns2="http://cxf.module.mule.org/">
            <name>MuleMan</name>
        </ns2:greet>
    </soapenv:Body>
</soapenv:Envelope>